app/controllers/applicants_controller.rb

  def index
    authorize(Applicant)
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"

  def create
    data = applicant_params
    data['is_seen'] = 0;
    data['user_id'] = current_user.id;
    @applicant = Applicant.new(data)

    authorize(@applicant ? @applicant : Applicant)

    if @applicant.save
---
INSERT INTO "applicants" ("user_id", "post_id", "is_seen", "attachment_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", nil], ["post_id", 7], ["is_seen", nil], ["attachment_url", "dadsa.com"], ["created_at", "2023-01-01 23:00:43.519320"], ["updated_at", "2023-01-01 23:00:43.519320"]]

  def seen
    if @applicant
      authorize(@applicant ? @applicant : Applicant)
      @applicant.is_seen = true
      @applicant.save
---
UPDATE "applicants" SET "is_seen" = $1, "updated_at" = $2 WHERE "applicants"."id" = $3  [["is_seen", true], ["updated_at", "2023-01-01 23:12:52.408922"], ["id", 7]]

  def set_applicant
    @applicant = Applicant.exists?(params[:id]) ? Applicant.find(params[:id]) : nil
---
SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]