app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    authorize(Post)
    @posts = Post.all

INSERT INTO "posts" ("title", "company_name", "description", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "zenhr"], ["company_name", "mawdoo3"], ["description", "any description"], ["admin_id", nil], ["created_at", "2023-01-01 14:25:32.892606"], ["updated_at", "2023-01-01 14:25:32.892606"]]
---
  def create
    @data = post_params
    @data[:admin_id] = current_member.id
    @post = Post.new(@data)
    authorize(@post ? @post : Post)

    if @post.save

UPDATE "posts" SET "company_name" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["company_name", "mawdoo3d65d4as654d65as4d6s"], ["updated_at", "2023-01-01 22:30:36.353120"], ["id", 2]]
---
  def update
     authorize(@post ? @post : Post)
    if @post
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
  def destroy
    authorize(@post ? @post : Post)
    if @post
      @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_post
    @post = Post.exists?(params[:id]) ? Post.find(params[:id]) : nil